app/controllers/courses_controller.rb

  def index

    if params['filter'] === nil
      @course = Course.all
---
SELECT "courses".* FROM "courses"

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]