app/controllers/faculties_controller.rb

 def index

    if params['filter'] === nil
      @faculties = Faculty.all
---
SELECT "faculties".* FROM "faculties"